
## :white_check_mark: Apply Succeeded (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/9839337422)



<pre><code>Apply complete! Resources: 3 imported, 1 added, 3 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.github_repository.current: Reading...
data.github_repository.current: Read complete after 1s [id=dotfiles]
github_actions_variable.tf_cloud_workspace: Refreshing state... [id=dotfiles:TF_CLOUD_WORKSPACE]
data.github_dependabot_secrets.current: Reading...
github_branch_protection.main: Refreshing state... [id=BPR_kwDOI-MFls4CWO3H]
github_issue_label.dependencies["minor"]: Preparing import... [id=dotfiles:minor]
github_issue_label.dependencies["patch"]: Preparing import... [id=dotfiles:patch]
github_issue_label.dependencies["dependencies"]: Preparing import... [id=dotfiles:dependencies]
github_issue_label.dependencies["minor"]: Refreshing state... [id=dotfiles:minor]
github_issue_label.dependencies["patch"]: Refreshing state... [id=dotfiles:patch]
github_issue_label.dependencies["dependencies"]: Refreshing state... [id=dotfiles:dependencies]
data.github_dependabot_secrets.current: Read complete after 0s [id=dotfiles]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_issue_label.dependencies["dependencies"] will be updated in-place
  # (imported from "dotfiles:dependencies")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "0366d6" -> "0366D6"
        description = "Pull requests that update a dependency file"
        etag        = "W/\"603f2c837e299d7ede8bd2429711a38bdf4c1a7d1b65dc68529bf55963a20613\""
        id          = "dotfiles:dependencies"
        name        = "dependencies"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/dependencies"
    }

  # github_issue_label.dependencies["major"] will be created
  + resource "github_issue_label" "dependencies" {
      + color      = "FF0000"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "major"
      + repository = "dotfiles"
      + url        = (known after apply)
    }

  # github_issue_label.dependencies["minor"] will be updated in-place
  # (imported from "dotfiles:minor")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "00FF00"
        description = null
        etag        = "W/\"cbf29fd9f9db5bbe9dbbc3fbe4d10072a9b58067510b7abe295cee0ef74b0b1f\""
        id          = "dotfiles:minor"
        name        = "minor"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/minor"
    }

  # github_issue_label.dependencies["patch"] will be updated in-place
  # (imported from "dotfiles:patch")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "0000FF"
        description = null
        etag        = "W/\"d44856a8afcb7452742a42fe145acd3db516529aa455a465a63fd36cb0b4bdb9\""
        id          = "dotfiles:patch"
        name        = "patch"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/patch"
    }

Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.
github_issue_label.dependencies["minor"]: Importing... [id=dotfiles:minor]
github_issue_label.dependencies["minor"]: Import complete [id=dotfiles:minor]
github_issue_label.dependencies["patch"]: Importing... [id=dotfiles:patch]
github_issue_label.dependencies["patch"]: Import complete [id=dotfiles:patch]
github_issue_label.dependencies["dependencies"]: Importing... [id=dotfiles:dependencies]
github_issue_label.dependencies["dependencies"]: Import complete [id=dotfiles:dependencies]
github_issue_label.dependencies["major"]: Creating...
github_issue_label.dependencies["dependencies"]: Modifying... [id=dotfiles:dependencies]
github_issue_label.dependencies["minor"]: Modifying... [id=dotfiles:minor]
github_issue_label.dependencies["patch"]: Modifying... [id=dotfiles:patch]
github_issue_label.dependencies["major"]: Creation complete after 5s [id=dotfiles:major]
github_issue_label.dependencies["dependencies"]: Modifications complete after 5s [id=dotfiles:dependencies]
github_issue_label.dependencies["minor"]: Modifications complete after 5s [id=dotfiles:minor]
github_issue_label.dependencies["patch"]: Modifications complete after 5s [id=dotfiles:patch]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 imported, 1 added, 3 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":159,"Program":"tfcmt","SHA1":"056859f65fb55169da5fb0eb3f8180005e14f77a","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->